Extra_tutorials/of5_MRFsimpleFOAM/coarse/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    inlet
    {
        type		fixedValue;
	value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    propeller
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    sides
    {
        type            symmetry;
    }
}


// ************************************************************************* //
