Extra_tutorials/of5_MRFsimpleFOAM/coarse/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/initialConditions"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
       type		calculated;
       value           $internalField;
    }

    outlet
    {
        type            calculated;
	value           $internalField;
    }

    propeller
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    sides
    {
        type            symmetry;
    }
}


// ************************************************************************* //
