Extra_tutorials/of5_MRFsimpleFOAM/coarse/Allrun.parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

runApplication blockMesh
runApplication surfaceFeatureExtract
runApplication snappyHexMesh -overwrite


#run in parallel
runApplication decomposePar
runParallel $application
runApplication reconstructPar -latestTime

#------------------------------------------------------------------------------
